# Dependencies are installed with `brew bundle`

# Majority of these have been copied from https://github.com/posquit0/brewfile/

cask_args appdir: '/Applications'

# Alternate versions of Casks
tap 'homebrew/cask-versions'
# Integrates Homebrew formulae with macOS' `launchctl` manager
tap 'homebrew/services'
# A CLI tool upgrading every outdated app installed by Homebrew Cask
# INFO: brew cu
tap 'buo/cask-upgrade'

### System Library {{{
  # Manage compile and link flags for libraries
  brew 'pkg-config'
  # Text-based UI library
  brew 'ncurses'
  # GNU internationalization (i18n) and localization (l10n) library
  brew 'gettext'
  # Library for command-line editing
  brew 'readline'
  # Core application library for C
  brew 'glib'
  # GNU multiple precision arithmetic library
  brew 'gmp'
  # Collection of portable C++ source libraries
  brew 'boost'
  # Vector graphics library with cross-device output support
  brew 'cairo'
  # Open source graph visualization software
  brew 'graphviz'
  # Framework for layout and rendering of i18n text
  brew 'pango'
  # Image manipulation library
  brew 'jpeg'
  # Library for manipulating PNG images
  brew 'libpng'
  # TIFF library and utilities
  brew 'libtiff'
  # Software library to render fonts
  brew 'freetype'
  # Generic library support script
  # INFO: In order to prevent conflicts with Apple's own libtool we have prepended a "g"
  brew 'libtool'
### }}}

### Utility {{{
  ## Mac OS X
  # Mac App Store command line interface
  brew 'mas' if OS.mac?
  # System Utilities for macOS
  cask 'onyx' if OS.mac?
  # Swiss Army Knife for macOS
  brew 'm-cli' if OS.mac?

  ## Mac OS X: Quick Look Plugins
  # An Application for Inspecting macOS Installer Packages
  cask 'suspicious-package' if OS.mac?
### }}}

### Container {{{
  # Docker Community Edition for Mac
  cask 'docker'
  # A tool for exploring each layer in a docker image
  brew 'dive'
  # The lazier way to manage everything docker
  brew 'lazydocker'
### }}}

### Kubernetes {{{
  # Kubernetes command-line interface
  brew 'kubernetes-cli'
  # Kubernetes CLI to manage cluters in style
  brew 'k9s'

  # The Kubernetes package manager
  tap 'helm/tap'
  brew 'helm'
  # A declarative spec for deploying Helm charts
  brew 'helmfile'
  # Hosting Helm Charts via GitHub Pages and Releases
  brew 'chart-releaser'
  # CLI tool for linting and testing Helm charts
  brew 'chart-testing'
  # Customization of kubernetes YAML configurations
  brew 'kustomize'
  # Tool for repeatable Kubernetes development
  brew 'skaffold'

  # Plugin manager for kubectl command-line tool
  brew 'krew'

  ## Access Control
  # Tool that can switch between kubectl contexts easily and create aliases
  brew 'kubectx'
  # The single pane of glass for all of your kubeconfig files.
  tap 'danielfoehrkn/switch'
  brew 'switch'
  # Plugin for kubectl OpenID Connect authentication
  tap 'int128/kubelogin'
  brew 'kubelogin'
  # Kubernetes Native Policy Management
  brew 'kyverno'
  # Summarize Kubernetes RBAC roles for the specified subjects
  tap 'Ladicle/kubectl-bindrole'
  brew 'kubectl-rolesum'

  ## Monitoring & Debugging
  # Kubernetes log viewer
  tap 'boz/repo'
  brew 'kail'
  # Multi pod and container log tailing for Kubernetes
  brew 'stern'
  # Bulk port forwarding Kubernetes services for local development
  tap 'txn2/tap'
  brew 'kubefwd'

  ## Cluster Provisioning
  # Production Grade K8s Installation, Upgrades, and Management
  brew 'kops'
  # A single-node Kubernetes cluster inside a VM on your laptop
  brew 'minikube'
### }}}

### Terminal Emulator {{{
  # Terminal emulator that uses platform-native UI and GPU acceleration
  cask 'ghostty'

  # A cross-platform, OpenGL terminal emulator.
  cask "alacritty"
### }}}

### Terminal Multiplexer {{{
  # A terminal workspace with batteries included
  brew 'zellij'

  # Terminal multiplexer with VT100/ANSI terminal emulation
  brew 'screen'
  # A terminal multiplexer, allowing to access multiple separate terminal sessions
  brew 'tmux'
  # Reattach process (e.g., tmux) to background
  brew 'reattach-to-user-namespace'

  # Share your terminal as a web application
  tap 'sorenisanerd/gotty'
  brew 'gotty'
### }}}

### Shell: Bash {{{
  # Bourne-Again SHell, a UNIX command interpreter
  brew 'bash'
  # Programmable completion for Bash 4.1+
  brew 'bash-completion@2'
### }}}

### Shell: Zsh {{{
  # UNIX shell (command interpreter)
  # INFO: Need to add `/usr/local/bin/zsh` to `/etc/shells`
  brew 'zsh'
  # Tips, tricks, and examples for zsh
  brew 'zsh-lovers'
### }}}

### Utility {{{
  # GNU File, Shell, and Text utilities
  brew 'coreutils'
  # Internet file retriever
  brew 'wget'


  ## Filesystem
  # Modern replacement for `ls`
  brew 'eza'
  # Display directories as trees
  brew 'tree'
  # A new way to see and navigate directory trees
  brew 'broot'
  # A command-line fuzzy finder
  brew 'fzf'
  # A smarter `cd` command
  brew 'zoxide'
  # Clone of cat with syntax highlighting and Git integration
  brew 'bat'
  # Pager program similar to more
  brew 'less'

  # Simple, fast and user-friendly alternative to find
  brew 'fd'
  # An extremely fast alternative to grep that respects your gitignore
  brew 'ripgrep'
  # GNU awk utiliy
  brew 'gawk'

  # Disk Usage/Free Utility - a better 'df' alternative
  brew 'duf'
  # A more intuitive version of du in rust
  brew 'dust'


  ## Compress
  # 7-Zip (high compression file archiver) implementation
  brew 'p7zip'
  # General-purpose data compression with high compression ratio
  brew 'xz'


  ## Process
  # Executes a program periodically, showing output fullscreen
  brew 'watch'
  # A modern watch command. Time machine and pager etc
  brew 'viddy'

  # A modern replacement for ps written in Rust
  brew 'procs'

  # Command-line benchmarking tool
  brew 'hyperfine'


  ## Monitoring
  # Yet another cross-platform graphical process/system monitor.
  brew 'bottom'
  # An interactive process viewer for Unix
  brew 'htop'
  # Display an interface's bandwidth usage
  brew 'iftop'
  # Top-like interface for container metrics
  brew 'ctop'
  # Glances an Eye on your system
  brew 'glances'
  # A dynamic real-time view of running eBPF programs
  brew 'bpftop' if OS.linux?


  ## MISC
  # Manage your dotfiles across multiple diverse machines, securely
  brew 'chezmoi'
  # Load/unload environment variables based on $PWD
  brew 'direnv'
  # Personal information dashboard for your Terminal
  brew 'wtfutil'

  # Simplified and community-driven man pages
  brew 'tldr'
  # Create and view interactive cheatsheets on the command-line
  brew 'cheat'
  # Record and share your terminal sessions, the simple way
  brew 'asciinema'
### }}}

### GitHub {{{
  # GitHub command-line tool
  brew 'gh'
  # GitHub notifications on your menu bar. Available on macOS, Windows & Linux
  cask 'gitify'
  # Safari Extension that simplifies the GitHub.com interface and adds useful features.
  mas 'Refined GitHub', id: 1519867270
### }}}

### VCS: Git {{{
  # Distributed revision control system
  brew 'git'


  ## Git Extension
  # Git extension for versioning large files
  brew 'git-lfs'
  # Extensions to follow Vincent Driessen's branching model
  brew 'git-flow'
  # Small git utilities
  brew 'git-extras'


  ## Git Client
  # Text interface for Git repositories
  brew 'tig'
  # A simple terminal UI for git commands
  brew 'lazygit'

  # OS X status bar application for GitHub
  # cask 'gitee'
  # The legendary Git GUI client
  # cask 'gitkraken'


  ## Git Utility
  # Prevents you from committing sensitive information to a git repo
  brew 'git-secrets'
  # Remove crazy big files, passwords, credentials and other private data
  brew 'bfg'

  # Secure, cross-platform Git credential storage with authentication to GitHub, Azure Repos, and other popular Git hosting services.
  tap 'microsoft/git'
  cask 'git-credential-manager'

  # A framework for managing and maintaining multi-language pre-commit hooks
  brew 'pre-commit'
  # Syntax-highlighting pager for git and diff output
  brew 'git-delta'
### }}}

### HashiCorp: Terraform {{{
  tap 'hashicorp/tap'
  # Tool to build, change, and version infrastructure
  # brew 'terraform'
  # A CLI tool to switch between different versions of terraform
  tap 'warrensbox/tap'
  brew 'tfswitch'
  # A Terraform Automation and Collaboration Software credentials helper
  tap 'tonedefdev/terracreds'
  brew 'terracreds'
  # Update version constraints in your Terraform configuration
  tap 'minamijoyo/tfupdate'
  brew 'tfupdate'
  # Interactivity select resource to plan / apply / destroy with target option
  tap 'future-architect/tap'
  brew 'tftarget'
  # Automatic Terraform moved blocks
  tap 'busser/tap'
  brew 'tfautomv'
  # Tool to generate documentation from Terraform modules
  brew 'terraform-docs'
  # A schema inspector for Terraform providers
  tap 'minamijoyo/tfschema'
  brew 'tfschema'
  # Display your Terraform module call stack in your terminal
  tap 'busser/tap'
  brew 'tftree'
  # Thin wrapper for Terraform e.g. for locking state
  brew 'terragrunt'
  # Terraform linter for detecting errors that can not be detected by `terraform plan`
  brew 'tflint'
  # Security scanner for your Terraform code
  brew 'tfsec'
  # Terraform textual UI
  tap 'idoavrah/homebrew'
  brew 'tftui'
  # Cost estimates for Terraform
  brew 'infracost'
### }}}

### Ansible {{{
  # Automate deployment, configuration, and upgrading
  brew 'ansible'
  # Best practices checker for Ansible
  brew 'ansible-lint'
  # Molecule aids in the development and testing of Ansible roles
  # INFO: Install using pip
  # brew 'molecule'
### }}}

### CI / CD {{{
  ## GitHub Actions
  # Run your GitHub Actions locally
  brew 'act'
  # Static checker for GitHub Actions workflow files
  brew 'actionlint'

  # Enables you to reproduce the CircleCI environment locally
  # brew 'circleci'
  # Command line tool for Drone CI
  # tap 'drone/drone'
  # brew 'drone'
### }}}


# Programming languages

## JSON & YAML
# Command-line JSON processor
brew 'jq'
# A portable command-line YAML, JSON and XML processor
brew 'yq'
# Linter for YAML files
brew 'yamllint'

## Node.js & Javascript
# Platform built on V8 to build network applications
# brew 'node'
# JavaScript toolchain manager for reproducible environments
brew 'volta'
# Secure runtime for JavaScript and TypeScript
brew 'deno'

## Python
# Python3
brew 'python'
# Python package management tool
brew 'poetry'
# Python dependency management tool
brew 'pyenv'
# Install and Run Python Applications in Isolated Environments
brew 'pipx'

## Golang
# Go
brew 'go'
# Fast linters runner for Go
brew 'golangci-lint'

## C Family
# GNU compiler collection
brew 'gcc'

## Ruby
# Powerful, clean, object-oriented scripting language
brew 'ruby'
# Ruby version manager
brew 'rbenv'
# Compile and install Ruby for rbenv
brew 'ruby-build'

## Shellscript
# Static analysis and lint tool, for (ba)sh scripts
brew 'shellcheck'

## Lua
# Powerful, lightweight programming language
brew 'lua'
# Just-In-Time Compiler (JIT) for the Lua programming language
brew 'luajit'
# Package manager for the Lua programming language
brew 'luarocks'

# Fonts
cask "font-hack-nerd-font"
cask "font-sf-mono-nerd-font"
cask "font-symbols-only-nerd-font"

